---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveFrontDirn2
source: html/2a9398d2-e92a-710a-0f66-dc307e2634c6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveFrontDirn2 Property

"Exterior Minor Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemActiveFrontDirn2 { get; }
```